Repository: bob-zebedy/CodexBar
Catalog: CodexBar/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en

# notification.task-waiting.body.project-tool
source: 「%1$@」等待批准 %2$@
en: "%1$@" needs approval %2$@

# notification.task-waiting.title
source: Codex 等待批准
en: Codex Is Waiting for Approval

# protection.caption
source: 任务长时间没有进展时隐藏并停止参与防睡眠
en: Hide inactive tasks and exclude them from keep-awake

# protection.duration.hours
source: %lld 小时
en: %lld hr

# protection.duration.thirty-minutes
source: 30 分钟
en: 30 min

# protection.title
source: 异常会话保护
en: Stalled Task Protection

# quota.credits.value
source: 积分: %@
en: Credits: %@

# quota.value.unlimited
source: 无限
en: Unlimited

# quota.window.fallback
source: 额度
en: Quota

# settings.about.github-project
source: GitHub 项目
en: GitHub Project

# settings.about.helper.authorized
source: 已授权
en: Authorized

# settings.about.helper.not-installed
source: 未安装
en: Not Installed

# settings.about.helper.requires-approval
source: 未授权
en: Not Authorized

# settings.about.helper.unavailable
source: 不可用
en: Unavailable

# settings.about.version
source: CodexBar 版本
en: CodexBar Version

# settings.auto-reset.title
source: 自动重置
en: Automatic Reset

# settings.codex.connection.action.reconnect
source: 重新建立连接
en: Reconnect

# settings.codex.connection.status.reconnecting
source: 正在重新连接
en: Reconnecting

# settings.codex.daemon.disconnected
source: 未连接
en: Not Connected

# settings.codex.daemon.in-use
source: 当前使用
en: In Use

# settings.codex.version.title
source: Codex 版本
en: Codex Versions

# settings.data-update.interval.title
source: 数据更新频率
en: Data Update Frequency

# settings.general.automatic-update-checks
source: 自动检查更新
en: Automatically Check for Updates

# settings.general.launch-at-login
source: 开机自动启动
en: Launch at Login

# settings.general.launch-at-login-failed
source: 设置开机启动失败
en: Could not update Launch at Login

# settings.hotkey.action.clear
source: 清除 App 快捷键
en: Clear App Shortcut

# settings.hotkey.prompt
source: 请设置快捷键
en: Press a Shortcut

# settings.hotkey.title
source: App 快捷键
en: App Shortcut

# settings.keep-alive.title
source: 防止睡眠
en: Prevent System Sleep

# settings.main-panel.animations
source: 动画效果
en: Animation Effects

# settings.main-panel.layout.title
source: 主面板布局
en: Main Panel Layout

# settings.main-panel.section.account
source: 账户
en: Account

# settings.main-panel.section.activity
source: 任务
en: Tasks

# settings.main-panel.section.quota
source: 额度
en: Quota

# settings.main-panel.section.status
source: 状态
en: Status

# settings.main-panel.section.usage
source: 用量
en: Usage

# settings.menu-bar-quota.title
source: 菜单栏额度指示
en: Menu Bar Quota Indicator

# settings.menu-bar-quota.window
source: 额度窗口
en: Quota Window

# settings.notifications.auto-reset.title
source: 自动重置通知
en: Automatic Reset Notifications

# settings.notifications.banked-reset-expiry.title
source: 重置临期通知
en: Reset Expiration

# settings.notifications.codex-tui.caption
source: Codex TUI 通知, 独立于 CodexBar 通知
en: Separate from CodexBar notifications

# settings.notifications.codex-tui.title
source: Codex TUI 通知
en: Codex TUI Notifications

# settings.notifications.keep-alive-limit.title
source: 防睡眠上限通知
en: Keep-Awake Limit

# settings.notifications.low-battery.title
source: 低电量保护通知
en: Low Battery Alert

# settings.notifications.low-quota.threshold
source: 低额度阈值
en: Low Quota Threshold

# settings.notifications.low-quota.title
source: 额度预警通知
en: Low Quota

# settings.notifications.quota-reset.title
source: 额度重置通知
en: Quota Reset

# settings.notifications.sound.title
source: 通知音效
en: Sound

# settings.notifications.system.permission-disabled
source: 系统通知权限未开启
en: Notification permission has not been granted

# settings.notifications.system.title
source: 系统通知
en: System Notifications

# settings.notifications.task-completion.minimum-duration
source: 任务时长
en: Task Duration

# settings.notifications.task-completion.title
source: 任务完成通知
en: Task Completion

# settings.notifications.task-haptics.caption
source: 任务完成或等待批准时触发触摸板震动
en: Trackpad haptics when tasks finish or await approval

# settings.notifications.task-haptics.title
source: 任务触觉反馈
en: Task Haptics

# settings.notifications.task-waiting.title
source: 任务等待通知
en: Approval Requests

# settings.sync.title
source: 跨设备同步
en: Sync Across Devices

# settings.tab.about
source: 关于
en: About

# settings.tab.advanced
source: 高级
en: Advanced

# settings.tab.general
source: 通用
en: General

# settings.task-glow.title
source: 流光效果
en: Glow Effect

# settings.window.title
source: CodexBar 设置
en: CodexBar Settings

# sync.error.activity-generation
source: %@ 的活动历史信息不完整, 无法同步
en: Activity history for %@ is missing required information and cannot be synced

# sync.error.activity-identity
source: 活动历史信息不一致, 无法同步
en: Activity history information is inconsistent and cannot be synced

# sync.error.retry-later
source: 同步失败, 请稍后重试
en: Sync failed; try again later

# sync.icloud.error.account-unavailable
source: iCloud 账户不可用
en: iCloud account unavailable

# sync.icloud.error.network-unavailable
source: 网络不可用
en: Network unavailable

# sync.icloud.error.service-unavailable
source: 同步服务暂不可用
en: Sync service is temporarily unavailable

# sync.status.disabled
source: 同步未开启
en: Sync is off

# sync.status.last-sync
source: 最近同步
en: Last Sync

# sync.status.last-sync-time
source: 最近同步: %@
en: Last sync: %@

# sync.status.no-history
source: 暂无同步记录
en: No sync history

# sync.status.syncing
source: 正在同步
en: Syncing

# sync.status.unavailable
source: 同步不可用
en: Sync unavailable

# task-glow.brightness.title
source: 亮度
en: Brightness

# task-glow.color.completed
source: 已完成
en: Completed

# task-glow.color.preview-help
source: 双击预览效果
en: Double-click to preview effect

# task-glow.color.running
source: 运行中
en: Running

# task-glow.color.terminated
source: 已终止
en: Stopped

# task-glow.color.waiting
source: 等待批准
en: Waiting for Approval

# task-glow.duration.title
source: 结束时长
en: End Duration

# task-glow.speed.fast
source: 较快
en: Faster

# task-glow.speed.slow
source: 较慢
en: Slower

# task-glow.speed.standard
source: 标准
en: Standard

# task-glow.speed.title
source: 动画速度
en: Animation Speed

# updater.action.check
source: 检查更新
en: Check for Updates

# updater.action.install
source: 立即更新
en: Update Now

# updater.status.check-failed
source: 检查更新失败
en: Could not check for updates

# updater.status.checking
source: 正在检查更新
en: Checking for updates

# updater.status.missing-configuration
source: 未配置更新源
en: Update source is not configured

# updater.status.up-to-date
source: 没有可用更新
en: CodexBar is up to date

# updater.status.update-available
source: 发现新版本: v%@
en: Version v%@ is available

# usage.heatmap.activity-metrics
source: 活动数据
en: Activity data

# usage.heatmap.no-data
source: 暂无日用量数据
en: No daily usage data

# usage.heatmap.past-weeks
source: 近 %lld 周
en: Past %lld Weeks

# usage.heatmap.token-metrics
source: 会话数据
en: Session data

# usage.heatmap.top-model
source: 最热模型
en: Top Model

# usage.status.last-updated
source: 数据更新时间
en: Updated

# usage.summary.current-streak
source: 当前连胜
en: Current Streak

# usage.summary.lifetime-tokens
source: 全时累计
en: Lifetime Tokens

# usage.summary.longest-chat
source: 最长任务
en: Longest Task

# usage.summary.longest-streak
source: 最长连胜
en: Longest Streak

# usage.summary.peak-tokens
source: 单日峰值
en: Peak Tokens

# usage.tokens.cache-hit-rate
source: 缓存命中率
en: Cache-H

# usage.tokens.cache-write-input
source: 缓存写入
en: Cache-W

# usage.tokens.cached-input
source: 缓存命中
en: Cached

# usage.tokens.input
source: 输入总计
en: Input

# usage.tokens.output
source: 输出总计
en: Output

# usage.tokens.reasoning-output
source: 推理输出
en: Reasoning

# usage.tokens.total
source: 总计
en: Total
